#include"proto.h"

//--------------------------------------------------------------------------
//			itoa 整型转化为十六进制
//--------------------------------------------------------------------------
void itoa(char *s,int input)
{
	char *p = s;
	char ch;
	int flag = 0;

	//十六进制0x
	*p = '0';
	p++;
	*p = 'x';
	p++;

	if(input == 0){
		*p = '0';
		p++;
	}else{
		for(int i=28;i>=0;i=i-4){
			ch = (input>>i) & 0x0F;
			if(flag || ch > 0){
				flag = 1;
				ch = ch + '0';
				if(ch > '9'){
					ch = ch + 7;
				}
				*p = ch;
				p++;
			}	
		}
	}

	*p = 0;
}


//--------------------------------------------------------------------------
//		disp_int 整型转换为十六进制字符输出
//--------------------------------------------------------------------------
void disp_int(int input)
{
	char output[16];
	itoa(output,input);
	char *s = output;
	disp_str(s);
}


//--------------------------------------------------------------------------
//		delay 延迟函数
//--------------------------------------------------------------------------
PUBLIC void delay(int time)
{
	int i, j, k;
	for(i=0;i<time;i++){
		for(j=0;j<500;j++){
			for(k=0;k<500;k++){}		
		}	
	}
}
